/**
 * Слід звернути увагу: параметри одного з викликів функції повинні бути згенеровані за допомогою генератора псевдовипадкових чисел random().
 * Слід звернути увагу (#2): продемонструвати встановлення вхідних даних через аргументи додатка (параметри командної строки). Обробити випадок, коли дані не передались - у цьому випадку вони матимуть значення за умовчуванням, обраними розробником.
 * 
 * 1. Реалізувати функцію (та продемонструвати її роботу), що визначає, скільки серед заданої послідовності чисел таких пар, у котрих перше число менше наступного, використовуючи функцію з варіативною кількістю аргументів. • Наприклад, при вхідних даних { 3, 2, 4, 3, 1 }, результат повинен бути 3 (тобто наступні пари чисел: 3, 2, 4, 3, 3, 1)
 */

#include "lib.h"

int main() {
	/// Инициализация переменных
	char char_array1[memorySize];

	/// Запрос данных
	printf("Input your array:\n");
	scanf("%[^\n]%*c", char_array1);

	/// Проверка на заполнение строки данными
	if (strlen(char_array1) != 0 && char_array1[0] != ' ') {
		/// Вычисление результата с помощь функций
		int res = countDescendOrderPairs(stringToIntArray(char_array1));
		printf("Result: %d\n", res);
	}

	return 0;
}
