#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <math.h>

/*
 * 24.(**)  Визначити,  чи  є задане число досконалим  (якщо воно дорівнює сумі своїх дільників). Наприклад, 6 -  досконале  число, бо  6  =  1 + 2 + 3.
*/
// Реалізувати програму за допомогою трьох типів циклів:  for, while-do, do-while (отримати три однакових результати)

int main() {
	// Инициализация переменных
	int num, sum = 1;
	double numSqrt;

	// Запрашиваем данные
	printf("Input your number':\n");
	scanf("%d", &num);

	// Проверяем являеться ли число "идеальным" с помощью механизма факторизации
	numSqrt = sqrt(num);
	for (int i = 2; i < numSqrt; i++) {
		// Проверяем что число делиться нацело на наш елемент перебора
		if (num % i == 0) {
			// Суммируем все числа, подходящие под выше описанные критерии
			sum += (i+num/i);
		}
	}
	
	// Вывод результатов
	if (num == sum) {
		printf("Iдеальне число");
	} else {
		printf("НЕIдеальне число");
	}

	return 0;
}