#include "lib.h"

/**
 * @file main.c
 * @author Tesliuk Vladyslav
 * @date 12-may-2024
 * @version 1.0.0
 */

/**
 * При виконанні  завдань слід зазначити, щоб:
 * 1. при старті програми виводилась інформація об авторі, номері та темі лабораторної роботи;
 * 2. при запиті даних,  користувач отримав повідомлення, що  від нього очікують;
 * 3. початкові дані вводилися з  клавіатури за допомогою функції  scanf().;
 * 4. видача результуючих даних проводилася у консоль за  допомогою функції  printf();
 * 5. після  запиту даних  треба  виконати валідацію  введених даних  з  точки зору бізнес  логіки;
 * 6. на  базі  введених  даних  створити  стосовні  дані  речових  чисел  в  діапазоні(-1000;    1000)    з мінімальним кроком 0.001
 * 7. результат  роботи  виводу  матриці  повинен  бути  відформатованим  стосовно  наступного прикладу:
 *     <pre>
 *         [ -5.25   33.25  23.00 ]
 *         [ -454.50 0.00   123.23 ]
 *         [ 323.99  123.55 -123.00 ]
 *     </pre>
 * Завдання:
 *  4. (*)  Визначити зворотню матрицю.
*/

int main() {
    int size;
    double matrix[MAX_SIZE][MAX_SIZE];
    double inverse[MAX_SIZE][MAX_SIZE];

    preview();

    printf("Введіть розмірність квадратної матриці (макс. %d): ", MAX_SIZE);
    scanf("%d", &size);

    if (size <= 0 || size > MAX_SIZE) {
        printf("Некоректний розмір матриці.\n");
        return 1;
    }

    readMatrix(matrix, size);
	printMatrix(matrix, size);

    inverseMatrix(matrix, inverse, size);

    return 0;
}
